In [1]:
import numpy as np
import pandas as pd

In [2]:
# Загрузка файла с данными
titanic_data = pd.read_csv("data/titanic.csv")
titanic_data.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [3]:
titanic_data.shape

(891, 15)

In [4]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

- Очистка данных

In [5]:
# удаление пустых значений
df1 = pd.DataFrame({
    "c0": {"r0":100, "r1":200, "r2":300},
    "c1": {"r1":400, "r2":500, "r3":600},
    "c2": {"r0":np.nan, "r1":200, "r2":300},
})
df1

       c0     c1     c2
r0  100.0    NaN    NaN
r1  200.0  400.0  200.0
r2  300.0  500.0  300.0
r3    NaN  600.0    NaN

In [9]:
# по умолчанию удаляются строки с  NuN
# df1.dropna()
# удаление столбцов с NuN
df1.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [r0, r1, r2, r3]

In [11]:
#  замена пустых значений  (NuN) на другие значения 
df1.fillna(0)

       c0     c1     c2
r0  100.0    0.0    0.0
r1  200.0  400.0  200.0
r2  300.0  500.0  300.0
r3    0.0  600.0    0.0

In [13]:
# удаление строк по индексам
df1.drop("r0" #, axis=0)

       c0     c1     c2
r1  200.0  400.0  200.0
r2  300.0  500.0  300.0
r3    NaN  600.0    NaN

In [14]:
# удаление столбцов по индексам
df1.drop("c1", axis=1)

       c0     c2
r0  100.0    NaN
r1  200.0  200.0
r2  300.0  300.0
r3    NaN    NaN

In [15]:
# выводим название строк , для правильного написания
titanic_data.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [16]:
# удаляем ненужные столбцы
td_1 = titanic_data.drop(['sibsp','parch','embarked','deck'], axis=1)
td_1.head()

,survived,pclass,sex,age,fare,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,7.2500,Third,man,True,Southampton,no,False
1,1,1,female,38.0,71.2833,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,7.9250,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,53.1000,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,8.0500,Third,man,True,Southampton,no,True

In [17]:
td_1 = td_1.fillna(0)
td_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   fare         891 non-null    float64
 5   class        891 non-null    object
 6   who          891 non-null    object
 7   adult_male   891 non-null    bool
 8   embark_town  891 non-null    object
 9   alive        891 non-null    object
 10  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(2), object(5)
memory usage: 64.5+ KB

In [18]:
# проверяем на наличие дубликатов
td_1.duplicated(["survived", "pclass","sex", "age", "embark_town", "fare", "alone"]).sum()

112

In [19]:
# удаление дубликатов
td_1.drop_duplicates(["survived", "pclass","sex", "age", "embark_town", "fare", "alone"], inplace =True)
td_1.duplicated(["survived", "pclass","sex", "age", "embark_town", "fare", "alone"]).sum()

0

In [20]:
td_1.shape

(779, 11)

- Анализ данных

In [21]:
td_1.head(10)

,survived,pclass,sex,age,fare,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,7.2500,Third,man,True,Southampton,no,False
1,1,1,female,38.0,71.2833,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,7.9250,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,53.1000,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,8.0500,Third,man,True,Southampton,no,True
5,0,3,male,0.0,8.4583,Third,man,True,Queenstown,no,True
6,0,1,male,54.0,51.8625,First,man,True,Southampton,no,True
7,0,3,male,2.0,21.0750,Third,child,False,Southampton,no,False
8,1,3,female,27.0,11.1333,Third,woman,False,Southampton,yes,False
9,1,2,female,14.0,30.0708,Second,child,False,Cherbourg,yes,False

In [24]:
# Сколько выживших
num_surv = td_1["survived"].sum() 
num_surv

321

In [25]:
# вычисление в процентах 
num_surv / td_1.shape[0]*100

41.206675224646986

In [26]:
# минимальный, средний, максимальный возрасты
td_1["age"].min(), td_1["age"].mean(),td_1["age"].max()

(0.0, 25.87088575096277, 80.0)

In [29]:
# значение по столбцу "survived" при условии "age" == 80
# комбинация маскирование по строкам и индексацию по столбцам
mask = td_1["age"] == 80
td_1.loc[mask,"survived"]

630    1
Name: survived, dtype: int64

In [30]:
# комбинация маскирование по строкам и среза по столбцам
td_1.loc[mask,:]

,survived,pclass,sex,age,fare,class,who,adult_male,embark_town,alive,alone
630,1,1,male,80.0,30.0,First,man,True,Southampton,yes,True

In [31]:
# значение по столбцу "survived" при условии "age" == 0.42
# комбинация маскирование по строкам и среза по столбцам
mask = td_1["age"] == 0.42
td_1.loc[mask,:]

,survived,pclass,sex,age,fare,class,who,adult_male,embark_town,alive,alone
803,1,3,male,0.42,8.5167,Third,child,False,Cherbourg,yes,False

In [32]:
# уникальные значения по столбцу "embark_town"
td_1["embark_town"].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', 0], dtype=object)

In [33]:
# количество уникальных значений
td_1["embark_town"].nunique()

4

In [34]:
# прихотливая индексация (fancy)
arr1= np.arange(10,20)
arr1

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19])

In [35]:
arr1[[0, 3, 1, 0, 5]]

array([10, 13, 11, 10, 15])

In [37]:
# значение по столбцу "survived" при условии "age" < 1
# комбинация маскирования по строкам и прихотливая индексация по столбцам
td_1.loc[td_1["age"] < 1, ["survived", "embark_town", "sex"]]

     survived  embark_town     sex
5           0   Queenstown    male
17          1  Southampton    male
19          1    Cherbourg  female
26          0    Cherbourg    male
28          1   Queenstown  female
..        ...          ...     ...
831         1  Southampton    male
839         1    Cherbourg    male
849         1    Cherbourg  female
868         0  Southampton    male
888         0  Southampton  female

[109 rows x 3 columns]

In [38]:
#  процент выживших детей
ch_surv = td_1.loc[td_1["age"] < 1, ["survived", "embark_town", "sex"]]
ch_surv["survived"].sum()/ ch_surv.shape[0]*100

40.36697247706422

### GroupBy
Операции:
- разбиение
- применение
- объединение

In [39]:
td_1.groupby("survived")[["age" , "pclass"]].mean()

                age    pclass
survived
0         26.492358  2.486900
1         24.984174  1.900312

In [40]:
td_1.groupby("survived").aggregate({"age": np.mean, "pclass": pd.Series.max})

                age  pclass
survived
0         26.492358       3
1         24.984174       3

In [42]:
# группировка данных по нескольким категориям
td_1.groupby(["survived", "who"])[["age", "pclass"]].mean()

                      age    pclass
survived who
0        child   7.220588  2.941176
         man    28.637741  2.385675
         woman  24.467213  2.836066
1        child   5.883750  2.395833
         man    28.482353  1.917647
         woman  28.279255  1.765957